# Hinzufügen/Löschen von Zeilen und Spalten

Video zu diesem Thema: https://youtu.be/HQ6XO9eT-fc

## <span style="color:#7030A0">Unser Setup</span>

In [56]:
import pandas as pd

# Beispieldaten vorbereiten

people = {
    'first': ['Gordon', 'Morgan', 'Naruto'],
    'last':  ['Freeman', 'Freeman', 'Uzumaki'],
    'email': ['gordonfreeman@valve.com', 'morganFreeman@email.com', 'narutoUzumaki@carlsen.com']
}

people_df = pd.DataFrame(people)

In [39]:
people_df

    first     last                      email
0  Gordon  Freeman    gordonfreeman@valve.com
1  Morgan  Freeman    morganFreeman@email.com
2  Naruto  Uzumaki  narutoUzumaki@carlsen.com

## <span style="color:#7030A0">Spalten hinzufügen</span>

In [40]:
people_df['first'] + ' ' + people_df['last'] # Änderung nicht permanent, dies ist ein Series-Object!

0    Gordon Freeman
1    Morgan Freeman
2    Naruto Uzumaki
dtype: object

In [41]:
people_df['full_name'] = people_df['first'] + ' ' + people_df['last'] # Änderung permanent
people_df

    first     last                      email       full_name
0  Gordon  Freeman    gordonfreeman@valve.com  Gordon Freeman
1  Morgan  Freeman    morganFreeman@email.com  Morgan Freeman
2  Naruto  Uzumaki  narutoUzumaki@carlsen.com  Naruto Uzumaki

## <span style="color:#7030A0">Spalten entfernen</span>

In [42]:
people_df.drop(columns=['first', 'last'], inplace=True)
people_df

                       email       full_name
0    gordonfreeman@valve.com  Gordon Freeman
1    morganFreeman@email.com  Morgan Freeman
2  narutoUzumaki@carlsen.com  Naruto Uzumaki

## <span style="color:#7030A0">Spalten aus existierenden Spalten erzeugen</span>

In [43]:
people_df['full_name'].str.split(' ', expand=True)

        0        1
0  Gordon  Freeman
1  Morgan  Freeman
2  Naruto  Uzumaki

In [44]:
people_df[['first', 'last']] = people_df['full_name'].str.split(' ', expand=True)
people_df

                       email       full_name   first     last
0    gordonfreeman@valve.com  Gordon Freeman  Gordon  Freeman
1    morganFreeman@email.com  Morgan Freeman  Morgan  Freeman
2  narutoUzumaki@carlsen.com  Naruto Uzumaki  Naruto  Uzumaki

## <span style="color:#7030A0">Zeilen hinzufügen

In [45]:
people_df = pd.concat([people_df, pd.DataFrame.from_records([{ 'first': 'Tony'}])])
people_df

                       email       full_name   first     last
0    gordonfreeman@valve.com  Gordon Freeman  Gordon  Freeman
1    morganFreeman@email.com  Morgan Freeman  Morgan  Freeman
2  narutoUzumaki@carlsen.com  Naruto Uzumaki  Naruto  Uzumaki
0                        NaN             NaN    Tony      NaN

In [46]:
people = {
    'first': ['Steve', 'Bill'],
    'last':  ['Jobs', 'Gates'],
    'email': ['steveJobs@apple.com', 'billGates@microsoft.com']
}

people_df2 = pd.DataFrame(people)
people_df2

   first   last                    email
0  Steve   Jobs      stevejobs@apple.com
1   Bill  Gates  billgates@microsoft.com

In [47]:
people_df = pd.concat([people_df, people_df2], ignore_index=True)
people_df

                       email       full_name   first     last
0    gordonfreeman@valve.com  Gordon Freeman  Gordon  Freeman
1    morganFreeman@email.com  Morgan Freeman  Morgan  Freeman
2  narutoUzumaki@carlsen.com  Naruto Uzumaki  Naruto  Uzumaki
3                        NaN             NaN    Tony      NaN
4        stevejobs@apple.com             NaN   Steve     Jobs
5    billgates@microsoft.com             NaN    Bill    Gates

## <span style="color:#7030A0">Zeilen entfernen</span>

In [53]:
people_df.drop(index=4) # Steve Jobs entfernen (nicht permanent, nutze inplace=True)

                       email       full_name   first     last
0    gordonfreeman@valve.com  Gordon Freeman  Gordon  Freeman
1    morganFreeman@email.com  Morgan Freeman  Morgan  Freeman
2  narutoUzumaki@carlsen.com  Naruto Uzumaki  Naruto  Uzumaki
3                        NaN             NaN    Tony      NaN
5    billgates@microsoft.com             NaN    Bill    Gates

In [55]:
filt = people_df['last'] == 'Freeman'
people_df.drop(index=people_df[filt].index) # Alle Freemans löschen

                       email       full_name   first     last
2  narutoUzumaki@carlsen.com  Naruto Uzumaki  Naruto  Uzumaki
3                        NaN             NaN    Tony      NaN
4        stevejobs@apple.com             NaN   Steve     Jobs
5    billgates@microsoft.com             NaN    Bill    Gates